[{"title":"Dead Reckoning the Mothership","author":{},"firstName":"Becky","lastName":"White","email":"trns4md@charter.net","content":"I am not a sailor, I am a Mom.  I have been doing this Mom thing for fourteen years.  At the beginning I was a working Mother, until there was an economic downturn at the same time as I was about to have my second child, ten years ago, and was laid off the day before I went into labor.  So began my journey from working Mom to stay-at-home Mom, which included adding two more kiddos into our growing family.  Now, here I am, all of the kids are on the cusp of being at school all day.  So now what?   In consideration of what to do now that I am home alone, it would seem that it would be easy to just go back to what I was doing before, or to just do anything, whatever I could find.  But, I am not one to settle.     I want something that fits me, something that I can contribute to creatively and something that challenges me.  I needed some dead reckoning.  Dead reckoning is taking measurements of where you are your heading, speed, and time in order to plot a course when you are sailing.  That is what I am doing, what makes sense to me, and to my family.  I am putting some Dead Reckoning to this Mothership. So what makes sense in today’s job market?  What can I do that will provide all those things, and financially not put us in more debt, yet be flexible enough to facilitate our family’s needs?  The definitive answer seemed to be Web Development.  Bootcamps are everywhere, the amount of resources that offer free to low cost training seem to be abundant.  Additionally, my former Bachelors Degree in Interior Design, and designing skills would make a great transition to website development.   My first destination on my coding journey was coding Bootcamp at Code Career Academy in Lawrenceville, GA.  This coding camp worked great for me for several reasons.  First, it was located thirty minutes from my house.  Most of the coding schools in the Atlanta area are in the downtown Atlanta area.  That is definitely not convenient and does not fit my family’s needs, to be fighting traffic for hours.  Second, there is an actual live person there to ask questions and to get you unstuck when you are coding something and learning how to debug code for the first time.   Third, it was a lot more affordable than the downtown code schools.   I am almost done with my bootcamp experience, I have a working knowledge of Front End tools such as HTML, CSS, Javascript, Bootstrap, and some Node and Express.  This is a great start to my journey and who knows where this might lead me?  My next destination isn’t known either, but I have a set of tools to begin and knowledge that I can build on with a community that I can tap into to continue to grow.  All I have to do is to keep checking my bearings, check the wind, and be prepared to give myself some course correction."},{"title":"Dead Reckoning the Mothership","author":{},"firstName":"Becky","lastName":"White","email":"trns4md@charter.net","content":"I am not a sailor, I am a Mom.  I have been doing this Mom thing for fourteen years.  At the beginning I was a working Mother, until there was an economic downturn at the same time as I was about to have my second child, ten years ago, and was laid off the day before I went into labor.  So began my journey from working Mom to stay-at-home Mom, which included adding two more kiddos into our growing family.  Now, here I am, all of the kids are on the cusp of being at school all day.  So now what?   In consideration of what to do now that I am home alone, it would seem that it would be easy to just go back to what I was doing before, or to just do anything, whatever I could find.  But, I am not one to settle.     I want something that fits me, something that I can contribute to creatively and something that challenges me.  I needed some dead reckoning.  Dead reckoning is taking measurements of where you are your heading, speed, and time in order to plot a course when you are sailing.  That is what I am doing, wh"}]